#+title: Emacs
#+startup: contents

* Eshell

#+begin_src emacs-lisp
  (defalias 'eshell/f  'find-file-other-window)
  (defalias 'eshell/ff 'find-file)
  (defalias 'eshell/v  'view-file-other-window)
  (defalias 'eshell/vv 'view-file)

  (csetq eshell-destroy-buffer-when-process-dies t)
  (csetq eshell-banner-message "")
#+end_src

#+begin_src emacs-lisp
  (csetq eshell-history-size 10000)
  (csetq eshell-hist-ignoredups t)
#+end_src

#+begin_src emacs-lisp
  (csetq eshell-cmpl-cycle-completions nil)
  (csetq eshell-cmpl-ignore-case t)
#+end_src

#+begin_src emacs-lisp
  (defun actuator-eshell-smart-shell ()
    "Set up Plan9/Smart shell in eshell."

    (require 'em-smart)
    (eval-when-compile (declare-function eshell-smart-initialize "em-smart"))
    (eshell-smart-initialize))
  (csetq eshell-where-to-jump 'begin)
  (csetq eshell-review-quick-commands nil)
  (csetq eshell-smart-space-goes-to-end t)
  (add-hook 'eshell-mode-hook #'actuator-eshell-smart-shell)
#+end_src

- [[http://xenodium.com/imenu-on-emacs-eshell/][imenu on Emacs eshell]] [2020-05-12 Tue]

#+begin_src emacs-lisp :tangle no
  (defun actuator-eshell-imenu ()
    "Set up eshell-imenu integration"

    (setq-local imenu-generic-expression
                '(("Prompt" "^.*?[#❯]" 1))))
  ;;(add-hook 'eshell-mode-hook #'actuator-eshell-imenu)
#+end_src

#+begin_src emacs-lisp :tangle no
  (defun actuator-eshell-autocomplete ()
    "Enable tab autocompletion in eshell."

    (define-key eshell-mode-map (kbd "TAB") #'actuator-eshell-autocomplete))
  (defun actuator-pcomplete-std-complete ()

    (interactive)
    (pcomplete-std-complete))
  ;;(add-hook 'eshell-mode-hook #'actuator-eshell-autocomplete)
#+end_src

#+results:
| actuator-fish-completion | actuator-eshell-autocomplete | actuator-eshell-imenu |

#+begin_src emacs-lisp
  (add-to-list 'package-selected-packages 'pcmpl-args)
  (with-eval-after-load 'eshell
    (require 'pcmpl-args nil t))
#+end_src

#+begin_src emacs-lisp
  (when *mac*
    (add-to-list 'package-selected-packages 'pcmpl-homebrew)
    (with-eval-after-load 'eshell
      (require 'pcmpl-homebrew nil t)))
#+end_src

#+begin_src emacs-lisp :tangle no
  (add-to-list 'package-selected-packages 'fish-completion)

  (csetq fish-completion-fallback-on-bash-p t)

  (defun actuator-set-up-eshell-fish-completion ()
    "arst"
    (when (executable-find "fish")
      (require 'fish-completion nil t)
      (fish-completion-mode)))

  ;;(add-hook 'eshell-mode-hook #'actuator-set-up-eshell-fish-completion)
#+end_src

#+begin_src emacs-lisp :tangle no
  (add-hook 'eshell-expand-input-functions
            #'eshell-expand-history-references)
#+end_src

#+begin_src emacs-lisp
  (defun fish-path (path max-len)
    "Return a potentially trimmed-down version of the directory PATH.
  Replacing parent directories with their initial characters to try
  to get the character length of PATH (sans directory slashes) down
  to MAX-LEN."
    (require 'cl-seq)
    (declare-function cl-reduce "cl-seq")
    (let* ((components (split-string (abbreviate-file-name path) "/"))
           (len (+ (1- (length components))
                   (cl-reduce '+ components :key 'length)))
           (str ""))
      (while (and (> len max-len)
                  (cdr components))
        (setq str (concat str
                          (cond ((= 0 (length (car components))) "/")
                                ((= 1 (length (car components)))
                                 (concat (car components) "/"))
                                (t
                                 (if (string= "."
                                              (string (elt (car components) 0)))
                                     (concat (substring (car components) 0 2)
                                             "/")
                                   (string (elt (car components) 0) ?/)))))
              len (- len (1- (length (car components))))
              components (cdr components)))
      (concat str (cl-reduce (lambda (a b) (concat a "/" b)) components))))
#+end_src

#+begin_src emacs-lisp
  (defun actuator-eshell-prompt ()
    "Custom prompt for eshell.

  Designed to be as minimalist as possible, while being moderately useful."

    (require 'eshell)
    (require 'em-dirs)
    (eval-when-compile (declare-function eshell/pwd "em-dirs"))
    (concat
     ;;(user-login-name)
     ;;"@"
     ;;(system-name)
     ;;":"
     (fish-path (eshell/pwd) 20)
     " ❯ "))
  (csetq eshell-prompt-regexp "^.+@.+:.+❯ ")
  (csetq eshell-prompt-function #'actuator-eshell-prompt)
#+end_src

